/******************************************************************************

                  版权所有 (C), 2001-2011, IOT CopyRight

 ******************************************************************************
  文 件 名   : BaseHandleThread.h
  版 本 号   : 初稿
  作    者   : ChenZhen
  生成日期   : 2017年2月17日
  最近修改   :
  功能描述   : BaseHandleThread.h 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2017年2月17日
    作    者   : ChenZhen
    修改内容   : 创建文件

******************************************************************************/
#ifndef __BASEHANDLETHREAD_H__
#define __BASEHANDLETHREAD_H__


/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
using namespace std;


/*----------------------------------------------*
 * 类声明                                       *
 *----------------------------------------------*/
class BaseHandleThread
{

};




#endif /* __BASEHANDLETHREAD_H__ */

